<a href="https://colab.research.google.com/github/VEKE-hub/WEEK-3-IP-PROJECT-RUN-CODE/blob/main/Copy_of_Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Edward_Mwavu_DataReport.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1.0 Preview

The main idea of this report is to identify how MTN Cote d'Ivoire would go about the upgrade of its infrastructure strategy within the given cities where MTN Côte d’Ivoire operates. We have data for 3 days.

2.0 Datasets

Below are the datasets used for this project:

.cells_geo_description.xlsx link

.cells_geo.csv link

.CDR_description.xlsx link

.CDR 20120507 [http://bit.ly/TelecomDataset1]

.CDR 20120508 [http://bit.ly/TelecomDataset2]

.CDR 20120509 [http://bit.ly/TelecomDataset3]

2.1 Importing the Libraries to be used

In [ ]:
# To import the pandas library, we use the below code:
#
import pandas as pd
# as well as the Numpy library
#
import numpy as np

2.2 Loading our Datasets

In [ ]:
#We first load cells_geo_description.xlsx
#url=https://drive.google.com/a/moringaschool.com/file/d/1-rIM5ihDu79RaH7rAs-d-7SQSAQhrY9N/
#we download from the above url and upload it in colab

df1=pd.read_excel('cells_geo_description.xlsx')
print(df1)

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [ ]:
# cells_geo.csv from the url https://drive.google.com/file/d/1ABZux280OjL3yWcOn8BDA_f5QsyO0QPU/
# url='https://drive.google.com/file/d/1ABZux280OjL3yWcOn8BDA_f5QsyO0QPU/view'
# we download the data and upload it in the notebook
df2=pd.read_csv('cells_geo.csv', delimiter=';')
df2.head(5)

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [ ]:
# CDR_description data from the url https://drive.google.com/file/d/1cVoNXl25IO5-_yQk97ThdeqhE6yw8YTD/view
# we download the data and upload it in the notebook

df3 = pd.read_excel('CDR_description.xlsx')
df3

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [ ]:
# CDR 20120507 [http://bit.ly/TelecomDataset1]
# we download the data and upload it in the notebook
#url='http://bit.ly/TelecomDataset1'
df4=pd.read_csv('Telcom_dataset1.csv')
df4.head(5)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
# CDR 20120508 [http://bit.ly/TelecomDataset2]
# we download the data and upload it in the notebook

df5=pd.read_csv('Telcom_dataset2.csv')
df5.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
# CDR 20120509 [http://bit.ly/TelecomDataset3]
# we download the data and upload it in the notebook

df6=pd.read_csv('Telcom_dataset3.csv')
df6.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

3.0 Data Exprolation

3.1 Cells Geo

In [ ]:
df2.head(3)

   Unnamed: 0  VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0  ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1  ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2  ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17

[3 rows x 12 columns]

In [ ]:
#changing the column name SITE_CODE to SITE_ID and deleting the former column
df2['SITE_ID']=df2['SITE_CODE']
del df2['SITE_CODE']

In [ ]:
# This counts the number of unique cities
cities = list(df2['VILLES'].unique())
len(cities)

504

In [ ]:
# This code gives the status of whether in service or not

Status = df2["STATUS"].value_counts(normalize=True)
print(Status)

In Service    1.0
Name: STATUS, dtype: float64

In [ ]:
#This code returns whether the locality was in Abidjan or not
Localize = df2["LOCALISATION"].value_counts(normalize=True)
print(Localize)

INTERIEUR    0.58002
ABIDJAN      0.41998
Name: LOCALISATION, dtype: float64

In [ ]:
#This code returns the unique Geographical zones and percentage of each Geographical zone
Geographical_zone = df2["DECOUPZONE"].value_counts(normalize=True)
print(Geographical_zone)

# We print the number of Geographical zones
print(len(list(df2['DECOUPZONE'].unique())))

Grand-OUEST        0.132864
Grand-NORD         0.130347
Grand-SUD          0.122043
Grand-EST          0.112733
Abidjan_EST        0.102416
Abidjan_CENTRE     0.092602
Abidjan_OUEST      0.090840
SUD-OUEST          0.077755
Abidjan_NORD       0.077252
Abidjan_SUD        0.053347
"Abidjan_EST       0.002013
"Abidjan_NORD      0.002013
Gd-ABIDJAN         0.001510
0                  0.001510
"Abidjan_CENTRE    0.000755
Name: DECOUPZONE, dtype: float64
15

In [ ]:
#This code returns the unique zones and percentage of each zone
Name_of_zone = df2["ZONENAME"].value_counts(normalize=True)
print(Name_of_zone)

# We print the number of zones
print(len(list(df2['ZONENAME'].unique())))

ZONE D - Grand-OUEST       0.132812
ZONE A - Grand-NORD        0.129788
ZONE B - Grand-SUD         0.119204
ZONE C - Grand-EST         0.110131
ZONE B - Abidjan_EST       0.099546
ZONE A - Abidjan_CENTRE    0.092994
ZONE C - Abidjan_OUEST     0.089466
ZONE E - SUD-OUEST         0.077873
ZONE E - Abidjan_NORD      0.076613
ZONE D - Abidjan_SUD       0.052167
ZONE B - Grand-EST         0.002268
ZONE D - Abidjan_EST       0.001512
ZONE B - Abidjan_CENTRE    0.001260
NPONON                     0.001008
OKAHOTEL                   0.001008
ZONE B - Grand-NORD        0.000756
ZONE B - Abidjan_Nord      0.000756
ZONE A - Abidjan_OUEST     0.000756
AGBANNEW                   0.000756
ZONE C - Abidjan_EST       0.000756
PALMABINGERVILLE           0.000756
ZONE A - Grand-SUD         0.000756
ZONE B - Abidjan_OUEST     0.000756
ZONE B - Abidjan-EST       0.000756
ZONE A - Grand-EST         0.000756
ZONE C - Abidjan_SUD       0.000756
ZONE D - Grand-SUD         0.000756
ASSINIE"                   0.000756
TIAMA                      0.000756
WILLIAMSVILLE2             0.000504
ZONE C - Grand-SUD         0.000504
ZONE B - Abidjan_SUD       0.000504
KRIKOREA"                  0.000252
Name: ZONENAME, dtype: float64
34

In [ ]:
#This code returns the unique regions and percentage of each region
Region = df2["REGION"].value_counts(normalize=True)
print(Region)

# We print the number of regions
print(len(list(df2['REGION'].unique())))

LAGUNE               0.465526
BAS SASSANDRA        0.062406
HAUT SASSANDRA       0.045294
LACS                 0.040262
VALLEE DU BANDAMA    0.039758
SAVANE               0.038752
SUD BANDAMA          0.032209
NZI COMOE            0.028183
FROMAGER             0.027680
ZANZAN               0.027177
AGNEBY               0.025918
18 MONTAGNES         0.025667
MOYEN CAVALLY        0.025667
WORODOUGOU           0.024912
SUD COMOE            0.022144
MOYEN COMOE          0.021137
MARAHOUE             0.019628
DENGUELE             0.017111
BAFING               0.010569
Name: REGION, dtype: float64
19

In [ ]:
#This code returns the unique cells and percentage of each cell
#Cells = df2["CELL_ID"].value_counts(normalize=True)
#print(Cells)

# We print the number of cells
#print(len(list(df2['CELL_ID'].unique())))

cells = df2['CELL_ID'].groupby(df2['VILLES'])
f=cells.count()
f.sort_values(ascending=False)

VILLES
COCODY         354
YOPOUGON       295
ABOBO          255
MARCORY        141
TREICHVILLE    132
              ...
LOUGBONON        3
MEMNI            2
KOTOULA          2
OUANGOLO         1
DANANON          1
Name: CELL_ID, Length: 504, dtype: int64

In [ ]:
#This code returns the unique sites and percentage of each site
Site = df2["SITE_ID"].value_counts(normalize=True)
print(Site)

# We print the number of cells
print(len(list(df2['SITE_ID'].unique())))

20387d4292    0.010569
c15166ba4d    0.002265
928a59b635    0.002265
5c565fbfb1    0.002265
4d3501719c    0.002013
                ...
17329b9161    0.000252
c661ab6aef    0.000252
133150e2f4    0.000252
d638af4028    0.000252
65135293ca    0.000252
Name: SITE_ID, Length: 1029, dtype: float64
1029

In [ ]:
#Geog_Abidan = df2[['DECOUPZONE','LOCALISATION']]
#print(Geog_Abidan)
Geog_Abidan = df2['DECOUPZONE'].groupby(df2['LOCALISATION'])
Geog_Abidan.count()

LOCALISATION
ABIDJAN      1669
INTERIEUR    2305
Name: DECOUPZONE, dtype: int64

In [ ]:
#Grouping localisation with region
Loc_Region = df2['LOCALISATION'].groupby(df2['REGION'])
Loc_Region.count()

REGION
18 MONTAGNES          102
AGNEBY                103
BAFING                 42
BAS SASSANDRA         248
DENGUELE               68
FROMAGER              110
HAUT SASSANDRA        180
LACS                  160
LAGUNE               1850
MARAHOUE               78
MOYEN CAVALLY         102
MOYEN COMOE            84
NZI COMOE             112
SAVANE                154
SUD BANDAMA           128
SUD COMOE              88
VALLEE DU BANDAMA     158
WORODOUGOU             99
ZANZAN                108
Name: LOCALISATION, dtype: int64

In [ ]:
#Grouping cells with region
cell_Region = df2['CELL_ID'].groupby(df2['REGION'])
cell_Region.count()

REGION
18 MONTAGNES          102
AGNEBY                103
BAFING                 42
BAS SASSANDRA         248
DENGUELE               68
FROMAGER              110
HAUT SASSANDRA        180
LACS                  160
LAGUNE               1850
MARAHOUE               78
MOYEN CAVALLY         102
MOYEN COMOE            84
NZI COMOE             112
SAVANE                154
SUD BANDAMA           128
SUD COMOE              88
VALLEE DU BANDAMA     158
WORODOUGOU             99
ZANZAN                108
Name: CELL_ID, dtype: int64

In [ ]:
#Grouping sites with region
Site_Region = (df2['SITE_ID']).groupby(df2['REGION']).unique()
Site_Region

REGION
18 MONTAGNES         [b9af583eac, 73652571a6, b7a160c985, 7957b0fb8...
AGNEBY               [c99c8fb224, 20387d4292, 84da272d13, e43742c52...
BAFING               [23acdcab2e, e8ab114fa9, 26c9f73a63, 547436da2...
BAS SASSANDRA        [ee63d0afe1, 4299ae845e, 50d116f73d, 1445989c8...
DENGUELE             [0e037c2d0c, 4ca5c45fac, 65758d2aae, de3cfcbca...
FROMAGER             [874a4d7efd, e293f755da, 1c90b51bb4, c6bd18d18...
HAUT SASSANDRA       [260dbfedc5, 06c4cb622d, 553ec95a14, 78a34ee53...
LACS                 [a65daaf5d3, 4b55d01457, 7c7a7a71b5, e8c387b61...
LAGUNE               [0bb492ef17, 56306cc7ca, c1ccd3443b, 17899e217...
MARAHOUE             [aa59cc7ced, 071cfaad35, 520b0637ca, 111335946...
MOYEN CAVALLY        [f4b59db47a, d9f94e58fa, 63192d48dc, 74f02009e...
MOYEN COMOE          [6e87d6cb59, aa2d7103fc, 00197a4f5f, 547385b9d...
NZI COMOE            [5f6100dbe1, 1e36fcb515, 3772ce7256, 16f265f4a...
SAVANE               [a048d79c3e, aeed65e7ce, f8c04693e1, 530e8cef0...
SUD BANDAMA          [32e88e3bb2, f5cfe0ed01, c7f65a4fc4, 90660365c...
SUD COMOE            [8a1e6ce31f, 38c5c1de07, 20387d4292, ac3b6998a...
VALLEE DU BANDAMA    [952ba02486, 52688ee7aa, 04bc287a75, 322c2ac5d...
WORODOUGOU           [9fd440bab4, ae4ba240c4, 1009d0bd35, eaad35729...
ZANZAN               [4757ea44db, 541c234a2f, b43fe6601a, 0c062a665...
Name: SITE_ID, dtype: object

3.2 Telcom Datasets

In [ ]:
#Changing column name and deleting the previous column for dataframes df4, df5 and df6
df5['DW_A_NUMBER_INT'] = df5['DW_A_NUMBER']
del df5['DW_A_NUMBER']
df5['DW_B_NUMBER_INT']=df5['DW_B_NUMBER']
del df5['DW_B_NUMBER']
df4['PRODUCT']=df4['PRODUTC']
del df4['PRODUTC']
df4['DATE_TIME']=df4['DATETIME']
del df4['DATETIME']
df6['SITE_ID']=df6['SIET_ID']
del df6['SIET_ID']
df6['CELL_ID']=df6['CELLID']
del df6['CELLID']

In [ ]:
#converting the DATETIME which is in string format to Date format

df4['new_date'] = pd.to_datetime(df4['DATE_TIME'])
df5['new_date'] = pd.to_datetime(df5['DATE_TIME'])
df6['new_date'] = pd.to_datetime(df6['DATE_TIME'])

In [ ]:
# We first view the dataframe of Telcom Dataset for May 07, 2012
df4.head(3)

   VALUE CELL_ON_SITE  ...              DATE_TIME            new_date
0      0            1  ...  2012-05-06 23:04:37.0 2012-05-06 23:04:37
1      0            0  ...  2012-05-06 23:05:25.0 2012-05-06 23:05:25
2     25            0  ...  2012-05-06 23:05:41.0 2012-05-06 23:05:41

[3 rows x 11 columns]

In [ ]:
#df4_5 = pd.concat(df4, df5)
#df4_5.head(3)
frames = [df4,df5,df6]
df456 = pd.concat(frames)

df456.head(3)

   VALUE CELL_ON_SITE  ...              DATE_TIME            new_date
0      0            1  ...  2012-05-06 23:04:37.0 2012-05-06 23:04:37
1      0            0  ...  2012-05-06 23:05:25.0 2012-05-06 23:05:25
2     25            0  ...  2012-05-06 23:05:41.0 2012-05-06 23:05:41

[3 rows x 11 columns]

In [ ]:
# finding the usage value for each product for 20120507
service_value_4 = df4['VALUE'].groupby(df4['PRODUCT'])
print(service_value_4.sum())
print(service_value_4.mean())

PRODUCT
Voice    108869
data       7032
sms       13473
Name: VALUE, dtype: int64
PRODUCT
Voice    49.062190
data      8.713755
sms       6.821772
Name: VALUE, dtype: float64

In [ ]:
    import time
    from time import mktime
    from datetime import datetime

In [ ]:
#Splitting the date column into day and time columns
df4['new_date_'] = [d.date() for d in df4['new_date']] # day
df4['new_time'] = [d.time() for d in df4['new_date']]  # time
df5['new_date_'] = [d.date() for d in df5['new_date']] # day
df5['new_time'] = [d.time() for d in df5['new_date']]  # time
df6['new_date_'] = [d.date() for d in df6['new_date']] # day
df6['new_time'] = [d.time() for d in df6['new_date']]  # time

In [ ]:
# finding the usage value for each product for 20120508
service_value_5 = df5['VALUE'].groupby(df5['PRODUCT'])
print(service_value_5.sum())
print(service_value_5.mean())

PRODUCT
Voice    103486
data       5500
sms       12713
Name: VALUE, dtype: int64
PRODUCT
Voice    54.294858
data      7.180157
sms       5.458566
Name: VALUE, dtype: float64

In [ ]:
# finding the usage value for each product for 20120509
service_value_6 = df6['VALUE'].groupby(df6['PRODUCT'])
print(service_value_6.sum())
print(service_value_6.mean())

PRODUCT
Voice    100238
data       4755
sms       27241
Name: VALUE, dtype: int64
PRODUCT
Voice    65.047372
data      6.861472
sms       9.844958
Name: VALUE, dtype: float64

In [ ]:
# finding the usage value for each product for 20120507, 20120508 &20120509
service_value_456 = df456['VALUE'].groupby(df456['PRODUCT'])
print(service_value_456.sum())
print(service_value_456.mean())

PRODUCT
Voice    312593
data      17287
sms       53427
Name: VALUE, dtype: int64
PRODUCT
Voice    55.169961
data      7.628861
sms       7.555791
Name: VALUE, dtype: float64

In [ ]:
#Getting the usage value by zone
value_456 = df456['VALUE'].groupby(df2['DECOUPZONE'])
a=value_456.sum()
b=value_456.mean()
a.sort_values(ascending=False)

DECOUPZONE
Grand-SUD          44780
Abidjan_EST        42936
Grand-OUEST        42200
Abidjan_OUEST      35357
Grand-NORD         33132
Abidjan_CENTRE     29547
Grand-EST          26955
SUD-OUEST          22515
Abidjan_NORD       16053
Abidjan_SUD        14845
Gd-ABIDJAN           511
0                    330
"Abidjan_EST         279
"Abidjan_NORD         71
"Abidjan_CENTRE       21
Name: VALUE, dtype: int64

In [ ]:
#Getting the usage value by cities

value_city = df456['VALUE'].groupby(df2['VILLES'])
c=value_city.sum()
print(c.sort_values(ascending=False))

VILLES
COCODY         39378
YOPOUGON       31848
ABOBO          13482
HIRE           13217
TREICHVILLE    11766
               ...
GBELEBAN           0
ASSIKOI            0
BOROTOU            0
BANANKORO          0
SIENSOBA           0
Name: VALUE, Length: 504, dtype: int64

In [ ]:
#ranking cities by time usage

day_456 = df456['new_date'].groupby(df2['VILLES'])
d=day_456.count()

d.sort_values(ascending=False)

VILLES
COCODY         1062
YOPOUGON        885
ABOBO           765
MARCORY         423
TREICHVILLE     396
               ...
LOUGBONON         9
MEMNI             6
KOTOULA           6
OUANGOLO          3
DANANON           3
Name: new_date, Length: 504, dtype: int64

In [ ]:
#Crearing a new column new_time that has time only

df456['new_time'] = pd.to_datetime(df456['new_date'],format= '%H' ).dt.time
df456.head(3)

   VALUE CELL_ON_SITE  ...            new_date  new_time
0      0            1  ... 2012-05-06 23:04:37  23:04:37
1      0            0  ... 2012-05-06 23:05:25  23:05:25
2     25            0  ... 2012-05-06 23:05:41  23:05:41

[3 rows x 12 columns]